load-tests/artillery/config/load-test-5k.yml
# ============================================================================
# LOAD TEST 5,000 CONCURRENT USERS
# Purpose: Test WebSocket chat with 5,000 concurrent connections
# Duration: 15 minutes with gradual ramp-up
# Target: http://localhost:4002 (Chat Service)
# ============================================================================
config:
  target: "http://localhost:4002"
  
  # Phases for 5000 concurrent users
  phases:
    # Phase 1: Gentle warm-up
    - duration: 180
      arrivalRate: 10
      name: "Warm up (1800 users/min)"
    
    # Phase 2: Gradual ramp to medium load
    - duration: 240
      arrivalRate: 25
      rampTo: 60
      name: "Ramp to medium load"
    
    # Phase 3: Ramp to 5000 concurrent
    - duration: 300
      arrivalRate: 60
      rampTo: 120
      name: "Ramp to 5000 concurrent"
    
    # Phase 4: Sustained peak load
    - duration: 420
      arrivalRate: 120
      name: "Sustained peak load (5000 users)"
    
    # Phase 5: Gradual cool down
    - duration: 180
      arrivalRate: 40
      name: "Cool down"

  # Socket.IO engine configuration
  engines:
    socketio-v3:
      extraHeaders:
        User-Agent: "Artillery-LoadTest-5K"

  # Custom JavaScript processor
  processor: "../processors/chat-processor.js"

  # Default scenario configuration
  defaults:
    socketio:
      transports: ["websocket", "polling"]
      timeout: 30000
      reconnection: true
      reconnectionAttempts: 3
      reconnectionDelay: 1000
      reconnectionDelayMax: 5000

scenarios:
  # ==========================================================================
  # SCENARIO 1: Active Chat User (50% weight)
  # High-frequency messaging user
  # ==========================================================================
  - name: "Active Chat User"
    engine: socketio-v3
    weight: 50
    beforeScenario: "generateAuthToken"
    afterScenario: "cleanupScenario"
    
    socketio:
      auth:
        token: "{{ token }}"
      transports: ["websocket"]
    
    onConnecting: "onConnecting"
    onConnect: "onConnect"
    onDisconnect: "onDisconnect"

    steps:
      - think: 2
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ greetingMessage }}"
        response:
          on: "receiveMessage"
          capture:
            - json: "$.id"
              as: "messageId"
            - json: "$.createdAt"
              as: "sentTimestamp"
          expect:
            - matchRegexp:
                json: "$.id"
                value: "^[0-9]+$"
        afterResponse: "onMessageReceived"
      
      - think: 2
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ randomMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 3
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ randomMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 4
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ randomMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 6

  # ==========================================================================
  # SCENARIO 2: Passive Chat User (25% weight)
  # User who mostly receives messages
  # ==========================================================================
  - name: "Passive Chat User"
    engine: socketio-v3
    weight: 25
    beforeScenario: "generateAuthToken"
    afterScenario: "cleanupScenario"
    
    socketio:
      auth:
        token: "{{ token }}"
      transports: ["websocket"]
    
    onConnect: "onConnect"
    onDisconnect: "onDisconnect"

    steps:
      - think: 8
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ passiveMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 12
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ acknowledgmentMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 10

  # ==========================================================================
  # SCENARIO 3: Bursty User (15% weight)
  # User who sends multiple messages quickly, then goes idle
  # ==========================================================================
  - name: "Bursty Chat User"
    engine: socketio-v3
    weight: 15
    beforeScenario: "generateAuthToken"
    afterScenario: "cleanupScenario"
    
    socketio:
      auth:
        token: "{{ token }}"
      transports: ["websocket"]
    
    onConnect: "onConnect"
    onDisconnect: "onDisconnect"

    steps:
      # Burst of messages
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ greetingMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 0.5
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ randomMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      - think: 0.5
      
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "{{ randomMessage }}"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      
      # Long idle period
      - think: 20

  # ==========================================================================
  # SCENARIO 4: Quick Connection Test (10% weight)
  # Tests connection stability under high load
  # ==========================================================================
  - name: "Quick Connection Test"
    engine: socketio-v3
    weight: 10
    beforeScenario: "generateAuthToken"
    afterScenario: "cleanupScenario"
    
    socketio:
      auth:
        token: "{{ token }}"
      transports: ["websocket"]
    
    onConnect: "onConnect"
    onDisconnect: "onDisconnect"

    steps:
      - think: 0.5
      - emit:
          channel: "sendMessage"
          data:
            targetUserId: "{{ targetUserId }}"
            message: "Quick ping"
        response:
          on: "receiveMessage"
        afterResponse: "onMessageReceived"
      - think: 0.5

# ============================================================================
# PLUGINS & REPORTING
# ============================================================================
plugins:
  metrics-by-endpoint:
    useOnlyRequestNames: true
  
  expect:
    reportFailures: true

# Relaxed thresholds for high load
ensure:
  - maxErrorRate: 10
  - maxResponseTime:
      p99: 5000